app/Services/WishListService.php

SELECT *
FROM `products`
WHERE `products`.`id` = '4'
---
    public function getAll($page = 1, $perPageLimit = 500)
    {
        $offset = ($page - 1) * $perPageLimit;
        $whishProducts = $this->model->where("user_id", $this->user->id)->orderBy('id', 'DESC')->findAll($perPageLimit, $offset);
        $data = [];
        foreach ($whishProducts as $whishProduct) {
            $productData = (new Product())->find($whishProduct['product_id']);